export const ProgramLabel = {
  math9: 'математика 9 класс',
  phys9: 'физика 9 класс',
  chem9: 'химия 9 класс',
  bio9: 'биология 9 класс',
  inf9: 'информатика 9 класс',
  rus9: 'русский 9 класс',
  lit9: 'литература 9 класс',
  soc9: 'обществознание 9 класс',
  his9: 'история 9 класс',
  eng9: 'английский 9 класс',
  geo9: 'география 9 класс',
  essay9: 'итоговое сочинение',

  math10: 'математика 9 класс',
  phys10: 'физика 9 класс',
  chem10: 'химия 10 класс',
  bio10: 'биология 10 класс',
  inf10: 'информатика 10 класс',
  rus10: 'русский язык 10 класс',
  lit10: 'литература 10 класс',
  soc10: 'обществознание 10 класс',
  his10: 'история 10 класс',
  eng10: 'английский язык 10 класс',

  math11: 'математика 11 класс',
  phys11: 'физика 11 класс',
  chem11: 'химия 11 класс',
  bio11: 'биология 11 класс',
  inf11: 'информатика 11 класс',
  rus11: 'русский язык 11 класс',
  lit11: 'литература 11 класс',
  soc11: 'обществознанеие 11 класс',
  his11: 'история 11 класс',
  eng11: 'английский язык 11 класс',
  geo11: 'география 11 класс',
  essay11: 'итоговое собеседование',

  mathExt: 'математика экстернат',
  physExt: 'физика экстернат',
  chemExt: 'химия экстернат',
  bioExt: 'биология экстернат',
  infExt: 'информатика экстернат',
  rusExt: 'русский язык экстернат',
  litExt: 'литература экстернат',
  socExt: 'обществознание экстернат',
  hisExt: 'история экстетрнат',
  engExt: 'английский язык экстернат',
  geoExt: 'география экстернат',

  mathSchool8: 'математика школа 8 класс',
  physSchool8: 'физика школа 8 класс',
  chemSchool8: 'химия школа 8 класс',
  bioSchool8: 'биология школа 8 класс',
  infSchool8: 'информатика школа 8 класс',
  rusSchool8: 'русский язык школа 8 класс',
  litSchool8: 'литература школа 8 класс',
  socSchool8: 'обществознание школа 8 класс',
  hisSchool8: 'история школа 8 класс',
  engSchool8: 'английский язык школа 8 класс',
  geoSchool8: 'география школа 8 класс',

  mathSchool9: 'математика школа 9 класс',
  physSchool9: 'физика школа 9 класс',
  chemSchool9: 'химия школа 9 класс',
  bioSchool9: 'биология школа 9 класс',
  infSchool9: 'информатика школа 9 класс',
  rusSchool9: 'русский язык школа 9 класс',
  litSchool9: 'литература школа 9 класс',
  socSchool9: 'обществознание школа 9 класс',
  hisSchool9: 'история школа 9 класс',
  engSchool9: 'английский язык школа 9 класс',
  geoSchool9: 'география школа 9 класс',

  physSchoolOge: 'физика школа ОГЭ',
  chemSchoolOge: 'химия школа ОГЭ',
  bioSchoolOge: 'биология школа ОГЭ',
  infSchoolOge: 'информатика школа ОГЭ',
  litSchoolOge: 'литература школа ОГЭ',
  socSchoolOge: 'обществознание школа ОГЭ',
  hisSchoolOge: 'история школа ОГЭ',
  engSchoolOge: 'английский язык школа ОГЭ',

  mathSchool10: 'математика школа 10 класс',
  physSchool10: 'физика школа 10 класс',
  chemSchool10: 'химия школа 10 класс',
  bioSchool10: 'биология школа 10 класс',
  infSchool10: 'информатика школа 10 класс',
  rusSchool10: 'русский язык школа 10 класс',
  litSchool10: 'литература школа 10 класс',
  socSchool10: 'обществознание школа 10 класс',
  hisSchool10: 'история школа 10 класс',
  engSchool10: 'английский язык школа 10 класс',

  mathSchool11: 'математика школа 11 класс',
  physSchool11: 'физика школа 11 класс',
  chemSchool11: 'химия школа 11 класс',
  bioSchool11: 'биология школа 11 класс',
  infSchool11: 'информатика школа 11 класс',
  rusSchool11: 'русский язык школа 11 класс',
  litSchool11: 'литература школа 11 класс',
  socSchool11: 'обществознание школа 11 класс',
  hisSchool11: 'история школа 11 класс',
  engSchool11: 'английский язык школа 11 класс',

  mathPracticum: 'математика практикум',
  physPracticum: 'физика практикум',
  chemPracticum: 'химия практикум',
  bioPracticum: 'биология практикум',
  infPracticum: 'информатика практикум',
  rusPracticum: 'русский язык практикум',
  socPracticum: 'обществознание практикум',
  hisPracticum: 'история практикум',
  engPracticum: 'английский язык практикум',
  geoPracticum: 'география практикум',

  mathBase: 'математика база',
  mathProf: 'математика профиль',
} as const

export const BranchLabel = {
  ohr: 'ОХР',
  pvn: 'ВЕР',
  bgt: 'БАГ',
  izm: 'ИЗМ',
  opl: 'ОКТ',
  rpt: 'РЯЗ',
  skl: 'СКЛ',
  orh: 'ОРЕ',
  ann: 'АНН',
  per: 'ПЕР',
  klg: 'КЛЖ',
  brt: 'БРА',
  str: 'СТР',
  vld: 'ВЛА',
  bel: 'БЕЛ',
  bib: 'БИБ',
  svi: 'СВИ',
  nag: 'НАГ',
  sok: 'СОК',
  pla: 'ПЛА',
  vod: 'ВОД',
  trg: 'ТУР',
} as const

export const RequestStatusLabel = {
  new: 'новые',
  awaiting: 'в ожидании',
  finished: 'выполненные',
} as const

export const LessonStatusLabel = {
  planned: 'запланировано',
  conducted: 'проведено',
  cancelled: 'отменено',
} as const

export const ContractLessonStatusLabel = {
  present: 'был',
  late: 'опоздал',
  absent: 'не был',
} as const

export const MonthLabel = [
  'янв', // январь
  'фев', // февраль
  'мар', // март
  'апр', // апрель
  'мая', // май
  'июн', // июнь
  'июл', // июль
  'авг', // август
  'сен', // сентябрь
  'окт', // октябрь
  'ноя', // ноябрь
  'дек', // декабрь
] as const

export const EntityType = {
  request: 'App\\Models\\Request',
  client: 'App\\Models\\Client',
  contract: 'App\\Models\\Contract',
  teacher: 'App\\Models\\Teacher',
  user: 'App\\Models\\User',
  group: 'App\\Models\\Group',
} as const

export const YearLabel = {
  2024: '2024–2025 уч. г.',
  2023: '2023–2024 уч. г.',
  2022: '2022–2023 уч. г.',
  2021: '2021–2022 уч. г.',
  2020: '2020–2021 уч. г.',
  2019: '2019–2020 уч. г.',
  2018: '2018–2019 уч. г.',
  2017: '2017–2018 уч. г.',
  2016: '2016–2017 уч. г.',
  2015: '2015–2016 уч. г.',
} as const

/* eslint-disable */
export const CabinetLabel = {
  '428': 'каб. 428',
  '430': 'каб. 430',
  '432': 'каб. 432',
  '433': 'каб. 433',
  '434': 'каб. 434',
  '439': 'каб. 439',
  '407': 'каб. 407',
  '409': 'каб. 409',
  '412': 'каб. 412',
  '413': 'каб. 413',
  '417': 'каб. 417',
  '422': 'каб. 422',
  '423': 'каб. 423',
  '424': 'каб. 424',
  '10': 'каб. 10',
  '35': 'каб. 35',
  '205': 'каб. 205',
  '214': 'каб. 214',
  '221': 'каб. 221',
  '301': 'каб. 301',
  '302': 'каб. 302',
  '303': 'каб. 303',
  '304': 'каб. 304',
  '305': 'каб. 305',
  '310': 'каб. 310',
  '311': 'каб. 311',
  '314': 'каб. 314',
  '319': 'каб. 319',
  '320': 'каб. 320',
  '321': 'каб. 321',
  '322': 'каб. 322',
  '507': 'каб. 507',
  '809': 'каб. 809',
} as const
/* eslint-enable */

export const TeacherStatusLabel = {
  inactive: 'неактивен',
  active: 'ведет занятия сейчас',
  earlyReserve: 'ранний запас',
  lateReserve: 'поздний запас',
  usedToWork: 'ранее работал',
  interview: 'собеседование',
  closed: 'закрыт',
} as const

export const SubjectLabel = {
  math: 'математика',
  phys: 'физика',
  chem: 'химимя',
  bio: 'биология',
  inf: 'информатика',
  rus: 'русский язык',
  lit: 'литература',
  soc: 'обществознание',
  his: 'история',
  eng: 'английский язык',
  geo: 'география',
  soch: 'сочинение',
} as const

export const SubjectLabelShort = {
  math: 'МАТ',
  phys: 'ФИЗ',
  chem: 'ХИМ',
  bio: 'БИО',
  inf: 'ИНФ',
  rus: 'РУС',
  lit: 'ЛИТ',
  soc: 'ОБЩ',
  his: 'ИСТ',
  eng: 'АНГ',
  geo: 'ГЕО',
  soch: 'СОЧ',
} as const

export const TeacherPaymentMethodLabel = {
  card: 'карта',
  cash: 'наличные',
  invoice: 'счёт',
  mutual: 'взаимозачёт',
} as const

export const ClientPaymentMethodLabel = {
  card: 'карта',
  online: 'карта онлайн',
  cash: 'наличные',
  invoice: 'счёт',
} as const

export const CompanyTypeLabel = {
  ooo: 'ООО',
  ip: 'ИП',
} as const

export const StatsModeLabel = {
  day: 'по дням',
  month: 'по месяцам',
  year: 'по годам',
} as const
